Revit 2026 API

# SpecUtils Methods

---

The SpecUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetAllSpecs | Gets the identifiers of all specs. |
|  | IsSpec | Checks whether a ForgeTypeId identifies a spec. |
|  | IsValidDataType | Returns true if the given ForgeTypeId identifies a valid parameter data type. |

#### Reference

SpecUtils Class

Autodesk.Revit.DB Namespace